In [1]:
import numpy as np 
import pandas as pd

1. Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values

In [2]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])
print("Original series:")
print(s)
print(s.str.upper())
print(s.str.lower())
print(s.str.len())

Original series:
0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object
0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object
0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object
0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

2. Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [3]:
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])
print("Original series:")
print(color1)
print(color1.str.strip())
print(color1.str.lstrip())
print(color1.str.rstrip())

Original series:
Index([' Green', 'Black ', ' Red ', 'White', ' Pink '], dtype='object')
Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')
Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')
Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

3. Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit.

In [4]:
nums = {'amount': [10, 250, 3000, 40000, 500000]}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df.dtypes)
print(df['amount'].apply(lambda x: '{0:0>8}'.format(x)))

Original dataframe:
amount    int64
dtype: object
0    00000010
1    00000250
2    00003000
3    00040000
4    00500000
Name: amount, dtype: object

4. Write a Pandas program to add leading zeros to the character column in a pandas series and makes the length of the field to 8 digit.

In [5]:
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
df['amount'] = list(map(lambda x: x.zfill(10), df['amount']))
print(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000
       amount
0  0000000010
1  0000000250
2  0000003000
3  0000040000
4  0000500000

5. Write a Pandas program to capitalize all the string values of specified columns of a given DataFrame.

In [6]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df['name'] = df['name'].apply(lambda x: x.capitalize())
print(df)

Original DataFrame:
      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0
      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

6. Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

In [7]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df['count_2'] = df['name_code'].str.count('2')
print(df)

Original DataFrame:
  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0
  name_code date_of_birth    age  count_2
0      c001     12/05/2002  18.5        0
1      c002     16/02/1999  21.2        1
2      c022     25/09/1998  22.5        2
3     c2002     12/02/2022  22.0        2
4     c2222     15/09/1997  23.0        4

7. Write a Pandas program to find the index of a given substring of a DataFrame column.

In [8]:
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)

df['index'] = df['name_code'].str.find('22')
df

Original DataFrame:
  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

  name_code date_of_birth    age  index
0      c001     12/05/2002  18.5     -1
1      c002     16/02/1999  21.2     -1
2      c022     25/09/1998  22.5      2
3     c2002     12/02/2022  22.0     -1
4     c2222     15/09/1997  23.0      1

8. Write a Pandas program to find the index of a substring of DataFrame with beginning and end position.

In [9]:
df = pd.DataFrame({
    'name_code': ['c0001','1000c','b00c2', 'b2c02', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df['index'] = df['name_code'].str.find('c',0,5)
print(df)

Original DataFrame:
  name_code date_of_birth    age
0     c0001     12/05/2002  18.5
1     1000c     16/02/1999  21.2
2     b00c2     25/09/1998  22.5
3     b2c02     12/02/2022  22.0
4     c2222     15/09/1997  23.0
  name_code date_of_birth    age  index
0     c0001     12/05/2002  18.5      0
1     1000c     16/02/1999  21.2      4
2     b00c2     25/09/1998  22.5      3
3     b2c02     12/02/2022  22.0      2
4     c2222     15/09/1997  23.0      0

9. Write a Pandas program to check whether alpha numeric values present in a given column of a DataFrame.
Note: isalnum() function returns True if all characters in the string are alphanumeric and there is at least one character, False otherwise.

In [10]:
df = pd.DataFrame({
    'name_code': ['Company','Company a001','Company 123', '1234', 'Company 12'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df['is_al_numeric'] = df['name_code'].str.isalnum()
print(df)

Original DataFrame:
      name_code date_of_birth    age
0       Company     12/05/2002  18.5
1  Company a001     16/02/1999  21.2
2   Company 123     25/09/1998  22.5
3          1234     12/02/2022  22.0
4    Company 12     15/09/1997  23.0
      name_code date_of_birth    age  is_al_numeric
0       Company     12/05/2002  18.5           True
1  Company a001     16/02/1999  21.2          False
2   Company 123     25/09/1998  22.5          False
3          1234     12/02/2022  22.0           True
4    Company 12     15/09/1997  23.0          False

10. Write a Pandas program to check whether alphabetic values present in a given column of a DataFrame.
Note: isalpha() returns True if all characters in the string are alphabetic and there is at least one character, False otherwise.

In [11]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001','Company 123', 'abcd', 'Company 12'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print("Original DataFrame:")
print(df)
df['is_alpha'] = df['company_code'].str.isalpha()
print(df)

Original DataFrame:
   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2   Company 123    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4    Company 12    15/09/1997         23.0
   company_code date_of_sale   sale_amount  is_alpha
0       Company    12/05/2002      12348.5      True
1  Company a001    16/02/1999     233331.2     False
2   Company 123    25/09/1998         22.5     False
3          abcd    12/02/2022    2566552.0      True
4    Company 12    15/09/1997         23.0     False

11. Write a Pandas program to check whether only numeric values present in a given column of a DataFrame.

In [12]:
df = pd.DataFrame({
    'company_code': ['Company','Company a001', '2055', 'abcd', '123345'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
	
print("Original DataFrame:")
print(df)
df['is_numeric'] = df['company_code'].str.isnumeric()
print(df)

Original DataFrame:
   company_code date_of_sale   sale_amount
0       Company    12/05/2002      12348.5
1  Company a001    16/02/1999     233331.2
2          2055    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4        123345    15/09/1997         23.0
   company_code date_of_sale   sale_amount  is_numeric
0       Company    12/05/2002      12348.5       False
1  Company a001    16/02/1999     233331.2       False
2          2055    25/09/1998         22.5        True
3          abcd    12/02/2022    2566552.0       False
4        123345    15/09/1997         23.0        True

12. Write a Pandas program to check whether only lower case or upper case is present in a given column of a DataFrame.

In [13]:
df = pd.DataFrame({
    'company_code': ['ABCD','EFGF', 'hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
print(df)
df['is_upper'] = df['company_code'].str.isupper()
print(df)

Original DataFrame:
  company_code date_of_sale   sale_amount
0         ABCD    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0
  company_code date_of_sale   sale_amount  is_upper
0         ABCD    12/05/2002      12348.5      True
1         EFGF    16/02/1999     233331.2      True
2         hhhh    25/09/1998         22.5     False
3         abcd    12/02/2022    2566552.0     False
4      EAWQaaa    15/09/1997         23.0     False

13. Write a Pandas program to check whether only proper case or title case is present in a given column of a DataFrame.

In [14]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'Hhhh', 'abcd', 'EAWQaaa'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
print(df)
df['is_title'] = df['company_code'].str.istitle()
print(df)

Original DataFrame:
  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2         Hhhh    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4      EAWQaaa    15/09/1997         23.0
  company_code date_of_sale   sale_amount  is_title
0         Abcd    12/05/2002      12348.5      True
1         EFGF    16/02/1999     233331.2     False
2         Hhhh    25/09/1998         22.5      True
3         abcd    12/02/2022    2566552.0     False
4      EAWQaaa    15/09/1997         23.0     False

14. Write a Pandas program to check whether only space is present in a given column of a DataFrame.

In [15]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF ', '  ', 'abcd', ' '],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

print("Original DataFrame:")
print(df)
df['is_space'] = df['company_code'].str.isspace()
print(df)

Original DataFrame:
  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1        EFGF     16/02/1999     233331.2
2                 25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4                 15/09/1997         23.0
  company_code date_of_sale   sale_amount  is_space
0         Abcd    12/05/2002      12348.5     False
1        EFGF     16/02/1999     233331.2     False
2                 25/09/1998         22.5      True
3         abcd    12/02/2022    2566552.0     False
4                 15/09/1997         23.0      True

15. Write a Pandas program to get the length of the string present of a given column in a DataFrame.

In [16]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})
print("Original DataFrame:")
print(df)
df['Company_code_len'] = df['company_code'].str.len()
print(df)

Original DataFrame:
  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2      skfsalf    25/09/1998         22.5
3      sdfslew    12/02/2022    2566552.0
4       safsdf    15/09/1997         23.0
  company_code date_of_sale   sale_amount  Company_code_len
0         Abcd    12/05/2002      12348.5                 4
1         EFGF    16/02/1999     233331.2                 4
2      skfsalf    25/09/1998         22.5                 7
3      sdfslew    12/02/2022    2566552.0                 7
4       safsdf    15/09/1997         23.0                 6

16. Write a Pandas program to get the length of the integer of a given column in a DataFrame.

In [17]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
print(df)
df['len_sale_amount']=df['sale_amount'].apply(lambda x: len(str(x)))
# df['sale_amount'].apply(str).apply(len)
print(df)

Original DataFrame:
  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount  len_sale_amount
0         Abcd   12/05/2002      12348.5                7
1         EFGF   16/02/1999     233331.2                8
2      skfsalf   25/09/1998         22.5                4
3      sdfslew   12/02/2022    2566552.0                9
4       safsdf   15/09/1997         23.0                4

17. Write a Pandas program to check if a specified column starts with a specified string in a DataFrame.

In [18]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
print(df)
df['startswithz_company_code'] = df['company_code'].str.startswith('z')
print(df)

Original DataFrame:
  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount  startswithz_company_code
0         Abcd   12/05/2002      12348.5                     False
1         EFGF   16/02/1999     233331.2                     False
2      zefsalf   25/09/1998         22.5                      True
3      sdfslew   12/02/2022    2566552.0                     False
4      zekfsdf   15/09/1997         23.0                      True

18. Write a Pandas program to swap the cases of a specified character column in a given DataFrame.

In [19]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
print(df)
df['swap_case_company_code']  = df['company_code'].str.swapcase()
print(df)

Original DataFrame:
  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount swap_case_company_code
0         Abcd   12/05/2002      12348.5                   aBCD
1         EFGF   16/02/1999     233331.2                   efgf
2      zefsalf   25/09/1998         22.5                ZEFSALF
3      sdfslew   12/02/2022    2566552.0                SDFSLEW
4      zekfsdf   15/09/1997         23.0                ZEKFSDF

19. Write a Pandas program to convert a specified character column in upper/lower cases in a given DataFrame.

In [20]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

df1 = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})
print("Original DataFrame:")
print(df)

df['company_code'] = df['company_code'].str.lower()
df1['company_code'] = df1['company_code'].str.upper()
print(df)
print(df1)

Original DataFrame:
  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount
0         abcd   12/05/2002      12348.5
1         efgf   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount
0         ABCD   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      ZEFSALF   25/09/1998         22.5
3      SDFSLEW   12/02/2022    2566552.0
4      ZEKFSDF   15/09/1997         23.0

20. Write a Pandas program to convert a specified character column in title case in a given DataFrame.

In [21]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

print("Original DataFrame:")
print(df)
df1['Title_case_company_code'] = df1['company_code'].str.title()
print(df1)

Original DataFrame:
  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4      zekfsdf   15/09/1997         23.0
  company_code date_of_sale  sale_amount Title_case_company_code
0         ABCD   12/05/2002      12348.5                    Abcd
1         EFGF   16/02/1999     233331.2                    Efgf
2      ZEFSALF   25/09/1998         22.5                 Zefsalf
3      SDFSLEW   12/02/2022    2566552.0                 Sdfslew
4      ZEKFSDF   15/09/1997         23.0                 Zekfsdf

21. Write a Pandas program to replace arbitrary values with other values in a given DataFrame.

In [22]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

print("Original DataFrame:")
print(df)
df.replace('A', 'C')

Original DataFrame:
  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

  company_code date_of_sale  sale_amount
0            C   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            C   15/09/1997         23.0

22. Write a Pandas program to replace more than one value with other values in a given DataFrame.

In [23]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

print("Original DataFrame:")
print(df)
df.replace({'A':'X', 'D':'Y'})

Original DataFrame:
  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

  company_code date_of_sale  sale_amount
0            X   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            Y   12/02/2022    2566552.0
4            X   15/09/1997         23.0

23. Write a Pandas program to split a string of a column of a given DataFrame into multiple columns.

In [24]:
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df[['fname', 'mname', 'lname']] = df['name'].str.split(' ', expand=True)
# print(df)
# df.replace({'':np.nan})
print(df)

Original DataFrame:
                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0
                 name date_of_birth    age    fname  mname    lname
0     Alberto  Franco     17/05/2002  18.5  Alberto          Franco
1    Gino Ann Mcneill     16/02/1999  21.2     Gino    Ann  Mcneill
2        Ryan  Parkes     25/09/1998  22.5     Ryan          Parkes
3  Eesha Artur Hinton     11/05/2002  22.0    Eesha  Artur   Hinton
4       Syed  Wharton     15/09/1997  23.0     Syed         Wharton

24. Write a Pandas program to extract email from a specified column of string type of a given DataFrame.

In [25]:
import re as re
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })
print("Original DataFrame:")
print(df)
def find_email(text):
    email = re.findall(r'[\w\.-]+@[\w\.-]+', str(text))
    return email

df['email'] = df.apply(lambda x: find_email(x))
print(df)

Original DataFrame:
                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com
                    name_email          email
0  Alberto Franco af@gmail.com   af@gmail.com
1    Gino Mcneill gm@yahoo.com   gm@yahoo.com
2        Ryan Parkes rp@abc.io      rp@abc.io
3                 Eesha Hinton  gm@github.com
4   Gino Mcneill gm@github.com            NaN

25. Write a Pandas program to extract hash attached word from twitter text from the specified column of a given DataFrame.

In [26]:
df = pd.DataFrame({
    'tweets': ['#Obama says goodbye','Retweets for #cash','A political endorsement in #Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")
print(df)
def find_hash(text):
    hword=re.findall(r'(?<=#)\w+',text)
    return " ".join(hword)
df['hash_word']=df['tweets'].apply(lambda x: find_hash(x))
print(df)

Original DataFrame:
                                  tweets
0                    #Obama says goodbye
1                     Retweets for #cash
2  A political endorsement in #Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg
                                  tweets  hash_word
0                    #Obama says goodbye      Obama
1                     Retweets for #cash       cash
2  A political endorsement in #Indonesia  Indonesia
3                 1 dog = many #retweets   retweets
4                     Just a simple #egg        egg

26. Write a Pandas program to extract word mention someone in tweets using @ from the specified column of a given DataFrame.

In [27]:
df = pd.DataFrame({
    'tweets': ['@Obama says goodbye','Retweets for @cash','A political endorsement in @Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")
print(df)

def find_at_word(text):
    word = re.findall(r'(?<=@)\w+', text)
    return " ".join(word)

df['at_word']  = df['tweets'].apply(find_at_word)
print(df)

Original DataFrame:
                                  tweets
0                    @Obama says goodbye
1                     Retweets for @cash
2  A political endorsement in @Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg
                                  tweets    at_word
0                    @Obama says goodbye      Obama
1                     Retweets for @cash       cash
2  A political endorsement in @Indonesia  Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg

27. Write a Pandas program to extract only number from the specified column of a given DataFrame.

In [35]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'address': ['7277 Surrey Ave.','920 N. Bishop Ave.','9910 Golden Star St.', '25 Dunbar St.', '17 West Livingston Court']
    })
print("Original DataFrame:")
print(df)

def find_number(text):
    num = re.findall(r'[0-9]+', text)
    return ''.join(num)

df['ident_number'] = df['address'].apply(find_number)
print(df)

Original DataFrame:
  company_code                   address
0        c0001          7277 Surrey Ave.
1        c0002        920 N. Bishop Ave.
2        c0003      9910 Golden Star St.
3        c0003             25 Dunbar St.
4        c0004  17 West Livingston Court
  company_code                   address ident_number
0        c0001          7277 Surrey Ave.         7277
1        c0002        920 N. Bishop Ave.          920
2        c0003      9910 Golden Star St.         9910
3        c0003             25 Dunbar St.           25
4        c0004  17 West Livingston Court           17

28. Write a Pandas program to extract only phone number from the specified column of a given DataFrame.

In [39]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'company_phone_no': ['Company1-Phone no. 4695168357','Company2-Phone no. 8088729013','Company3-Phone no. 6204658086', 'Company4-Phone no. 5159530096', 'Company5-Phone no. 9037952371']
    })
print("Original DataFrame:")
print(df)

def phone_number(text):
    ph_num = re.findall(r'\b\d{10}\b', text)
    return ''.join(ph_num)

df['company_phone_no'].apply(phone_number)

Original DataFrame:
  company_code               company_phone_no
0        c0001  Company1-Phone no. 4695168357
1        c0002  Company2-Phone no. 8088729013
2        c0003  Company3-Phone no. 6204658086
3        c0003  Company4-Phone no. 5159530096
4        c0004  Company5-Phone no. 9037952371

0    4695168357
1    8088729013
2    6204658086
3    5159530096
4    9037952371
Name: company_phone_no, dtype: object

29. Write a Pandas program to extract year between 1800 to 2200 from the specified column of a given DataFrame.

In [41]:
df = pd.DataFrame({
    'company_code': ['c0001','c0002','c0003', 'c0003', 'c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")
print(df)
def find_year(text):
    #line=re.findall(r"\b(18[0][0]|2[0-2][00])\b",text)
    result = re.findall(r"\b(18[0-9]{2}|19[0-8][0-9]|199[0-9]|2[01][0-9]{2}|2200)\b",text)
    return result

df['year'].apply(find_year)

Original DataFrame:
  company_code       year
0        c0001  year 1800
1        c0002  year 1700
2        c0003  year 2300
3        c0003  year 1900
4        c0004  year 2200

0    [1800]
1        []
2        []
3    [1900]
4    [2200]
Name: year, dtype: object

30. Write a Pandas program to extract only non alphanumeric characters from the specified column of a given DataFrame.

In [49]:
df = pd.DataFrame({
    'company_code': ['c0001#','c00@0^2','$c0003', 'c0003', '&c0004'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")
print(df)

def pfind(text):
    pf = re.findall(r'[^A-Za-z0-9]', text)
    return ''.join(pf)

df['company_code'].apply(pfind)

Original DataFrame:
  company_code       year
0       c0001#  year 1800
1      c00@0^2  year 1700
2       $c0003  year 2300
3        c0003  year 1900
4       &c0004  year 2200

0     #
1    @^
2     $
3
4     &
Name: company_code, dtype: object

31. Write a Pandas program to extract only punctuations from the specified column of a given DataFrame.

In [50]:
df = pd.DataFrame({
    'company_code': ['c0001.','c000,2','c0003', 'c0003#', 'c0004,'],
    'year': ['year 1800','year 1700','year 2300', 'year 1900', 'year 2200']
    })
print("Original DataFrame:")
print(df)
def find_punctuations(text):
    result = re.findall(r'[!"\$%&\'()*+,\-.\/:;=#@?\[\\\]^_`{|}~]*', text)
    string="".join(result)
    return list(string)
df['nonalpha']=df['company_code'].apply(lambda x: find_punctuations(x))
print("\nExtracting punctuation:")
print(df)

Original DataFrame:
  company_code       year
0       c0001.  year 1800
1       c000,2  year 1700
2        c0003  year 2300
3       c0003#  year 1900
4       c0004,  year 2200

Extracting punctuation:
  company_code       year nonalpha
0       c0001.  year 1800      [.]
1       c000,2  year 1700      [,]
2        c0003  year 2300       []
3       c0003#  year 1900      [#]
4       c0004,  year 2200      [,]

32. Write a Pandas program to remove repetitive characters from the specified column of a given DataFrame.

In [51]:
df = pd.DataFrame({
    'text_code': ['t0001.','t0002','t0003', 't0004'],
    'text_lang': ['She livedd a long life.', 'How oold is your father?', 'What is tthe problem?','TThhis desk is used by Tom.']
    })
print("Original DataFrame:")
print(df)

Original DataFrame:
  text_code                    text_lang
0    t0001.      She livedd a long life.
1     t0002     How oold is your father?
2     t0003        What is tthe problem?
3     t0004  TThhis desk is used by Tom.

33. Write a Pandas program to extract numbers greater than 940 from the specified column of a given DataFrame.

34. Write a Pandas program to extract numbers less than 100 from the specified column of a given DataFrame.

35. Write a Pandas program to check whether two given words present in a specified column of a given DataFrame.

36. Write a Pandas program to extract date (format: mm-dd-yyyy) from a given column of a given DataFrame.

37. Write a Pandas program to extract only words from a given column of a given DataFrame.

38. Write a Pandas program to extract the sentences where a specific word is present in a given column of a given DataFrame.

39. Write a Pandas program to extract the unique sentences from a given column of a given DataFrame.

40. Write a Pandas program to extract words starting with capital words from a given column of a given DataFrame.

41. Write a Pandas program to remove the html tags within the specified column of a given DataFrame.